In [53]:
import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [54]:
import pandas as pd

data = {
    'First Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)

# Funksiya yaratamiz: ustun nomlarini kichik harflar bilan va bo'sh joylarni _ bilan almashtiradi
def rename_columns(col_name):
    return col_name.lower().replace(' ', '_')

# .rename() metodiga funksiyani beramiz, har bir ustun nomiga ishlaydi
df = df.rename(columns=rename_columns)

print(df)

  first_name  age           city
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [35]:
df.head(3)

  first_name  age           city
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [38]:
yosh=df['age']
yosh.mean()

np.float64(32.5)

In [48]:
# Faqat 'Ism' va 'Shahar' ustunlarini tanlang va chop eting
db1=df[['first_name','age']]
db1

  first_name  age
0      Alice   25
1        Bob   30
2    Charlie   35
3      David   40

In [47]:
import pandas as pd
import numpy as np

data = {
    'First Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)

# Tasodifiy maoshlarni yaratamiz (masalan, 30000 dan 80000 gacha)
np.random.seed(42)  # Natijani takrorlash uchun (ixtiyoriy)
df['Salary'] = np.random.randint(30000, 80001, size=len(df))


print(df)

  First Name  Age           City  Salary
0      Alice   25       New York   45795
1        Bob   30  San Francisco   30860
2    Charlie   35    Los Angeles   68158
3      David   40        Chicago   74732

In [48]:
print(df.describe())

             Age        Salary
count   4.000000      4.000000
mean   32.500000  54886.250000
std     6.454972  20247.671938
min    25.000000  30860.000000
25%    28.750000  42061.250000
50%    32.500000  56976.500000
75%    36.250000  69801.500000
max    40.000000  74732.000000

In [68]:
import pandas as pd
Month=['jan','feb','mar','apr']	
Sales=[500,600,750,800]
Expenses=[300,350,400,450]

saless={'month':Month,
                    'sales':Sales,
                    'expenses':Expenses}

sales_and_expenses=pd.DataFrame(saless)
min_=sales_and_expenses['sales'].min()
print(min_)
max_=sales_and_expenses['sales'].max()
print(max_)
mean_=sales_and_expenses['sales'].mean()
print(mean_)

500
800
662.5

In [87]:
Category=['Rent','Utilities','Groceries','Groceries']	
January=[1200,200,300,150]  
February=[1300,220,310,160]	
March=[1400,240,320,170]	
April=[1500,250,330,180]
data={'category':Category,
      'january':January,
      'february':February,
      'March':March,
      'april':April}
Expense=pd.DataFrame(data)
mx=Expense['max']=Expense[['january',	'february'	,'March'	,'april']].max(axis=1)
print(mx)
mn=Expense['min']=Expense[['january',	'february'	,'March'	,'april']].min(axis=1)
print(mn)
mn
mm=Expense['mean']=Expense[['january',	'february'	,'March'	,'april']].mean(axis=1)
print(mm)
Expense

0    1500
1     250
2     330
3     180
dtype: int64
0    1200
1     200
2     300
3     150
dtype: int64
0    1350.0
1     227.5
2     315.0
3     165.0
dtype: float64

    category  january  february  March  april   max   min    mean
0       Rent     1200      1300   1400   1500  1500  1200  1350.0
1  Utilities      200       220    240    250   250   200   227.5
2  Groceries      300       310    320    330   330   300   315.0
3  Groceries      150       160    170    180   180   150   165.0